# XOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbolProfile..::..XOffset Property
FamilySymbolProfile Class See Also
---
The offset of the profile to the origin of the sketch plane in the X direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double XOffset { get; set; }
```

Visual Basic
---
```text
Public Property XOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double XOffset {
	double get ();
	void set (double value);
}
```

# See Also
FamilySymbolProfile Class
Autodesk.Revit.DB Namespace